{ "translations": {
    "External Apps" : "Apps externes",
    "Failed to enable ExApp" : "No s'ha pogut activar ExApp",
    "Failed to disable ExApp" : "No s'ha pogut desactivar ExApp",
    "Could not update ExApp" : "No s'ha pogut actualitzar ExApp",
    "AppAPI authentication failed" : "Ha fallat l'autenticació de l'AppAPI",
    "AppAPI ExApp version update notifier" : "Notificador d'actualització de versió AppAPI ExApp",
    "AppAPI ExApp notifier" : "Notificador AppAPI ExApp",
    "AppAPI" : "AppAPI",
    "Nextcloud AppAPI" : "Nextcloud AppAPI",
    "### Boost your Nextcloud with AppAPI and its specially designed applications.\n\n\nThe AppAPI is a project within the Nextcloud ecosystem designed to streamline and enhance the process of\napplication development, deployment, and management.\n\nIt introduces a new methodology that allows developers to create\napplications using a variety of programming languages, not limited to PHP, which was traditionally used in Nextcloud development.\n\n\n### List of applications that require AppAPI:\n\n- [talk_bot_ai_example](https://github.com/cloud-py-api/talk_bot_ai_example)\n- [upscaler_example](https://github.com/cloud-py-api/upscaler_example)\n- [image_to_text_example](https://github.com/cloud-py-api/file_to_text_example)\n- [ai_image_generator_bot](https://github.com/cloud-py-api/ai_image_generator_bot)\n\n_If you wish to develop an application, we will gladly help and assist you._\n\n### Support\n\nWe appreciate any support for this project:\n\n- ⭐ Star our work on GitHub\n- ❗ Create an Issue or feature request\n- 💁 Resolve an Issue and create a Pull Request\n- 🧑‍💻 Develop your own application using AppAPI\n\nWe are genuinely excited about the future of the AppAPI project and its potential to transform\nthe way applications are developed and experienced within Nextcloud.\n\nAs we embark on this journey, we warmly invite you - developers, thinkers, creators, and visionaries -\nto join us in shaping a more versatile, stable, and secure app landscape.\n\n*Your insights, suggestions, and contributions are invaluable to us.*" : "### Potencia el teu Nextcloud amb AppAPI i les seves aplicacions especialment dissenyades..\n\n\nL'AppAPI és un projecte dins de l'ecosistema Nextcloud dissenyat per racionalitzar i millorar el procés de\ndesenvolupament, desplegament i gestió d'aplicacions.\n\nIntrodueix una nova metodologia que permet als desenvolupadors crear\naplicacions que utilitzen una varietat de llenguatges de programació, no limitats a PHP, que s'utilitzava tradicionalment en el desenvolupament de Nextcloud.\n\n\n### Llista d'aplicacions que requereixen AppAPI:\n\n- [talk_bot_ai_example](https://github.com/cloud-py-api/talk_bot_ai_example)\n- [upscaler_example](https://github.com/cloud-py-api/upscaler_example)\n- [image_to_text_example](https://github.com/cloud-py-api/file_to_text_example)\n- [ai_image_generator_bot](https://github.com/cloud-py-api/ai_image_generator_bot)\n\n_Si voleu desenvolupar una aplicació, us ajudarem i ajudarem amb molt de gust._\n\n### Suport\n\nAgraïm qualsevol suport a aquest projecte:\n\n- ⭐ Destaca el nostre treball a GitHub\n- ❗ Creeu un problema o sol·licitud de funció\n- 💁 Resoldre un problema i crear una sol·licitud d'extracció\n- 🧑‍💻 Desenvolupa la teva pròpia aplicació amb AppAPI\n\nEstem realment entusiasmats amb el futur del projecte AppAPI i el seu potencial de transformació\nla manera com es desenvolupen i s'experimenten les aplicacions a Nextcloud.\n\nA mesura que ens embarquem en aquest viatge, us convidem cordialment: desenvolupadors, pensadors, creadors i visionaris -\nper unir-nos a la creació d'un panorama d'aplicacions més versàtil, estable i segur.\n\n*Les vostres idees, suggeriments i contribucions són inestimables per a nosaltres.*",
    "The AppAPI Project is an exciting initiative that aims to revolutionize the way applications are developed for Nextcloud." : "El projecte AppAPI és una iniciativa emocionant que pretén revolucionar la manera com es desenvolupen les aplicacions per a Nextcloud.",
    "External Apps management" : "Gestió d'Apps externes",
    "Admin options saved" : "Opcions d'administració desades",
    "Failed to save admin options" : "No s'han pogut desar les opcions d'administració",
    "Update to {version}" : "Actualització a la versió {version}",
    "Remove" : "Suprimeix",
    "This app has no minimum Nextcloud version assigned. This will be an error in the future." : "Aquesta aplicació no té cap versió mínima de Nextcloud assignada. Això serà un error en el futur.",
    "This app has no maximum Nextcloud version assigned. This will be an error in the future." : "Aquesta aplicació no té cap versió màxima de Nextcloud assignada. Això serà un error en el futur.",
    "This app cannot be installed because the following dependencies are not fulfilled:" : "Aquesta aplicació no es pot instal·lar perquè les següents dependències no es compleixen:",
    "View in store" : "Mostra-ho a la botiga",
    "Visit website" : "Visita el lloc web",
    "Report a bug" : "Informa d'un error",
    "User documentation" : "Documentació per a usuaris",
    "Admin documentation" : "Documentació per a administradors",
    "Developer documentation" : "Documentació per a desenvolupadors",
    "This app is supported via your current Nextcloud subscription." : "Aquesta aplicació és compatible amb la vostra subscripció actual a Nextcloud.",
    "Supported" : "Compatible",
    "Featured apps are developed by and within the community. They offer central functionality and are ready for production use." : "Les aplicacions destacades es desenvolupen per i dins de la comunitat. Ofereixen funcionalitats centrals i estan preparades per ser emprades en producció.",
    "Featured" : "Destacada",
    "Update to {update}" : "Actualitza a {update}",
    "Icon" : "Icona",
    "Name" : "Nom",
    "Version" : "Versió",
    "Daemon" : "Dimoni",
    "Level" : "Nivell",
    "Actions" : "Accions",
    "Results from other categories" : "Resultats d'altres categories",
    "_Update_::_Update all_" : ["Actualitza","Actualitza-les totes"],
    "Type" : "Tipus",
    "Display Name" : "Nom d'usuari",
    "{license}-licensed" : "sota la llicència - {license}",
    "Delete" : "Suprimir",
    "Cancel" : "Cancelar",
    "Ok" : "D'acord",
    "Host" : "Servidor",
    "Nextcloud URL" : "Nextcloud URL",
    "Display name" : "Nom de visualització",
    "Network" : "Xarxa",
    "Register" : "Registra",
    "Your apps" : "Les vostres aplicacions",
    "Details" : "Detalls",
    "Changelog" : "Registre de canvis",
    "by {author}\n{license}" : "{author}\n{license}",
    "Active apps" : "Aplicacions actives",
    "Disabled apps" : "Aplicacions inhabilitades",
    "Updates" : "Actualitzacions",
    "Featured apps" : "Aplicacions destacades",
    "Supported apps" : "Aplicacions compatibles",
    "Enable" : "Activa",
    "Disable" : "Inhabilita",
    "Allow untested app" : "Permet l'aplicació no provada",
    "This app is not marked as compatible with your Nextcloud version. If you continue you will still be able to install the app. Note that the app might not work as expected." : "Aquesta aplicació no està marcada com a compatible amb la vostra versió de Nextcloud. Si continueu, encara podreu instal·lar l’aplicació. Tingueu en compte que pot ser que l’aplicació no funcioni correctament.",
    "An error occurred during the request. Unable to proceed." : "S'ha produït un error durant la sol·licitud. No es pot continuar.",
    "Error: This app cannot be enabled because it makes the server unstable" : "Error: aquesta aplicació no es pot habilitar perquè fa que el servidor sigui inestable"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}