{ "translations": {
    "Update to {version}" : "Oppdater til {version}",
    "This app has no minimum Nextcloud version assigned. This will be an error in the future." : "Denne appen har ingen minimumversjon av Nextcloud definert. Dette vil være en feil i fremtiden.",
    "This app has no maximum Nextcloud version assigned. This will be an error in the future." : "Denne appen har ingen høyeste versjon av Nextcloud definert. Dette vil være en feil i fremtiden.",
    "This app cannot be installed because the following dependencies are not fulfilled:" : "Denne appen kan ikke installeres fordi følgende avhengigheter ikke er tilfredsstilt:",
    "View in store" : "Vis i butikk",
    "Visit website" : "Besøk nettsiden",
    "Report a bug" : "Rapporter en feil",
    "User documentation" : "Brukerdokumentasjon",
    "Admin documentation" : "Administratordokumentasjon",
    "Developer documentation" : "Utviklerdokumentasjon",
    "This app is supported via your current Nextcloud subscription." : "Denne appen er støttet av ditt nåværende Nextcloud abonnement.",
    "Supported" : "Støttet",
    "Featured apps are developed by and within the community. They offer central functionality and are ready for production use." : "Anbefalte apper er utviklet av og innenfor fellesskapet. De tilbyr sentral funksjonalitet og er klare for bruk i produksjon.",
    "Featured" : "Anbefalt",
    "Update to {update}" : "Oppdater til {update}",
    "Icon" : "Ikon",
    "Name" : "Navn",
    "Version" : "Versjon",
    "Daemon" : "Nisse",
    "Level" : "Nivå",
    "Actions" : "Handlinger",
    "Results from other categories" : "Resultater fra andre kategorier",
    "_Update_::_Update all_" : ["Oppdater","Oppdater alle"],
    "Type" : "Type",
    "Display Name" : "Visningsnavn",
    "Default" : "Forvalg",
    "{license}-licensed" : "{license}-lisensiert",
    "Delete" : "Slett",
    "Cancel" : "Avbryt",
    "Ok" : "Ok",
    "Host" : "Server",
    "Nextcloud URL" : "Nextcloud URL",
    "Network" : "Nettverk",
    "Register" : "Registrer",
    "Your apps" : "Dine apper",
    "Details" : "Detaljer",
    "Changelog" : "Endringslogg",
    "by {author}\n{license}" : "av {author}\n{license}",
    "Active apps" : "Aktive apper",
    "Disabled apps" : "Deaktiverte apper",
    "Updates" : "Oppdateringer",
    "Featured apps" : "Fremhevede apper",
    "Supported apps" : "Støttede apper",
    "Enable" : "Aktiver",
    "Disable" : "Deaktiver",
    "Allow untested app" : "Tillatt utestet app",
    "This app is not marked as compatible with your Nextcloud version. If you continue you will still be able to install the app. Note that the app might not work as expected." : "Denne appen er ikke merket som kompatibel med Nextcloud-versjonen. Hvis du fortsetter, vil du fortsatt kunne installere appen. Vær oppmerksom på at appen kanskje ikke fungerer som forventet.",
    "An error occurred during the request. Unable to proceed." : "En feil oppsto under forespørselen. Kan ikke fortsette.",
    "Error: This app cannot be enabled because it makes the server unstable" : "Feil: denne appen kan ikke aktiveres fordi det gjør serveren ustabil"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}