{ "translations": {
    "External Apps" : "Eksterne apper",
    "Only docker-install is supported for now" : "Kun docker-installasjon støttes for øyeblikket",
    "Failed to register ExApp" : "Registrering av ExApp feilet",
    "Failed to deploy ExApp" : "Distribuering av ExApp feilet",
    "Failed to send \"init\" event to ExApp." : "Sending av \"init\"-hendelse til ExApp feilet.",
    "Failed to enable ExApp" : "Aktivering av ExApp feilet",
    "Failed to disable ExApp" : "Deaktivering av ExApp feilet",
    "Could not update ExApp" : "Kunne ikke oppdatere ExApp",
    "ExApp not found, failed to get status" : "ExApp ikke funnet, henting av status feilet",
    "AppAPI authentication failed" : "AppAPI-autentisering feilet",
    "AppAPI ExApp version update notifier" : "AppAPI ExApp versjonsoppdateringsvarsler",
    "AppAPI ExApp notifier" : "AppAPI ExApp-varsler",
    "AppAPI" : "AppAPI",
    "Nextcloud AppAPI" : "Nextcloud AppAPI",
    "### Boost your Nextcloud with AppAPI and its specially designed applications.\n\n\nThe AppAPI is a project within the Nextcloud ecosystem designed to streamline and enhance the process of\napplication development, deployment, and management.\n\nIt introduces a new methodology that allows developers to create\napplications using a variety of programming languages, not limited to PHP, which was traditionally used in Nextcloud development.\n\n\n### List of applications that require AppAPI:\n\n- [talk_bot_ai_example](https://github.com/cloud-py-api/talk_bot_ai_example)\n- [upscaler_example](https://github.com/cloud-py-api/upscaler_example)\n- [image_to_text_example](https://github.com/cloud-py-api/file_to_text_example)\n- [ai_image_generator_bot](https://github.com/cloud-py-api/ai_image_generator_bot)\n\n_If you wish to develop an application, we will gladly help and assist you._\n\n### Support\n\nWe appreciate any support for this project:\n\n- ⭐ Star our work on GitHub\n- ❗ Create an Issue or feature request\n- 💁 Resolve an Issue and create a Pull Request\n- 🧑‍💻 Develop your own application using AppAPI\n\nWe are genuinely excited about the future of the AppAPI project and its potential to transform\nthe way applications are developed and experienced within Nextcloud.\n\nAs we embark on this journey, we warmly invite you - developers, thinkers, creators, and visionaries -\nto join us in shaping a more versatile, stable, and secure app landscape.\n\n*Your insights, suggestions, and contributions are invaluable to us.*" : "### Forsterk Nextcloud med AppAPI og spesialdesignede applikasjoner.\n\n\nAppAPI er et prosjekt innenfor Nextcloud-økosystemet designet for å effektivisere og forbedre prosessen med\nprogramutvikling, distribusjon og administrasjon.\n\nDen introduserer en ny metodikk som lar utviklere lage\napplikasjoner som bruker en rekke programmeringsspråk, ikke begrenset til PHP, som tradisjonelt ble brukt i Nextcloud-utvikling.\n\n\n### Liste over programmer som krever AppAPI:\n\n- [talk_bot_ai_example](https://github.com/cloud-py-api/talk_bot_ai_example)\n- [upscaler_example](https://github.com/cloud-py-api/upscaler_example)\n- [image_to_text_example](https://github.com/cloud-py-api/file_to_text_example)\n- [ai_image_generator_bot](https://github.com/cloud-py-api/ai_image_generator_bot)\n\n_Hvis du ønsker å utvikle en applikasjon, hjelper og hjelper vi deg gjerne._\n\n### Støtte\n\nVi setter pris på all støtte til dette prosjektet:\n\n- ⭐ Stjernemerk arbeidet vårt på GitHub\n- ❗ Opprette en sak eller en funksjonsforespørsel\n- 💁 Løs et problem og opprett en Pull-forespørsel\n- 🧑‍💻 Utvikle din egen applikasjon ved hjelp av AppAPI\n\nVi er virkelig begeistret for fremtiden til AppAPI-prosjektet og dets potensial til å transformere\nmåten applikasjoner utvikles og oppleves på i Nextcloud.\n\nNår vi legger ut på denne reisen, inviterer vi deg hjertelig - utviklere, tenkere, skapere og visjonære -\ntil å bli med oss i å forme et mer allsidig, stabilt og sikkert applandskap.\n\n*Din innsikt, forslag og bidrag er uvurderlig for oss.*",
    "The AppAPI Project is an exciting initiative that aims to revolutionize the way applications are developed for Nextcloud." : "AppAPI-prosjektet er et spennende initiativ som har som mål å revolusjonere måten applikasjoner utvikles for Nextcloud.",
    "Deploy Daemons" : "Distribuer daemons",
    "Update to {version}" : "Oppdater til {version}",
    "Remove" : "Fjern",
    "This app has no minimum Nextcloud version assigned. This will be an error in the future." : "Denne appen har ingen minimumversjon av Nextcloud definert. Dette vil være en feil i fremtiden.",
    "This app has no maximum Nextcloud version assigned. This will be an error in the future." : "Denne appen har ingen høyeste versjon av Nextcloud definert. Dette vil være en feil i fremtiden.",
    "This app cannot be installed because the following dependencies are not fulfilled:" : "Denne appen kan ikke installeres fordi følgende avhengigheter ikke er tilfredsstilt:",
    "View in store" : "Vis i butikk",
    "Visit website" : "Besøk nettsiden",
    "Report a bug" : "Rapporter en feil",
    "User documentation" : "Brukerdokumentasjon",
    "Admin documentation" : "Administratordokumentasjon",
    "Developer documentation" : "Utviklerdokumentasjon",
    "This app is supported via your current Nextcloud subscription." : "Denne appen er støttet av ditt nåværende Nextcloud abonnement.",
    "Supported" : "Støttet",
    "Featured apps are developed by and within the community. They offer central functionality and are ready for production use." : "Anbefalte apper er utviklet av og innenfor fellesskapet. De tilbyr sentral funksjonalitet og er klare for bruk i produksjon.",
    "Featured" : "Anbefalt",
    "Update to {update}" : "Oppdater til {update}",
    "Icon" : "Ikon",
    "Name" : "Navn",
    "Version" : "Versjon",
    "Daemon" : "Nisse",
    "Level" : "Nivå",
    "Actions" : "Handlinger",
    "Results from other categories" : "Resultater fra andre kategorier",
    "_Update_::_Update all_" : ["Oppdater","Oppdater alle"],
    "Type" : "Type",
    "Display Name" : "Visningsnavn",
    "Default" : "Forvalg",
    "{license}-licensed" : "{license}-lisensiert",
    "Delete" : "Slett",
    "Cancel" : "Avbryt",
    "Ok" : "Ok",
    "Host" : "Server",
    "Nextcloud URL" : "Nextcloud URL",
    "Network" : "Nettverk",
    "Register" : "Registrer",
    "Your apps" : "Dine apper",
    "Details" : "Detaljer",
    "Changelog" : "Endringslogg",
    "by {author}\n{license}" : "av {author}\n{license}",
    "Active apps" : "Aktive apper",
    "Disabled apps" : "Deaktiverte apper",
    "Updates" : "Oppdateringer",
    "Featured apps" : "Fremhevede apper",
    "Supported apps" : "Støttede apper",
    "Enable" : "Aktiver",
    "Disable" : "Deaktiver",
    "Allow untested app" : "Tillatt utestet app",
    "This app is not marked as compatible with your Nextcloud version. If you continue you will still be able to install the app. Note that the app might not work as expected." : "Denne appen er ikke merket som kompatibel med Nextcloud-versjonen. Hvis du fortsetter, vil du fortsatt kunne installere appen. Vær oppmerksom på at appen kanskje ikke fungerer som forventet.",
    "An error occurred during the request. Unable to proceed." : "En feil oppsto under forespørselen. Kan ikke fortsette.",
    "Error: This app cannot be enabled because it makes the server unstable" : "Feil: denne appen kan ikke aktiveres fordi det gjør serveren ustabil"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}